#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repos.github_repository.repository_branch_autoinit["MS-Tes11"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"766619ee73aa9180ab9ac2b6f1ede5d7bd24714cb610ebde3cee0209c9505201\"" -> "W/\"75230f292b820ad8fe68caf34b63f8fd55fbfc8c9074cb23c1a56903ff47085e\""
        id                          = "MS-Tes11"
        name                        = "MS-Tes11"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test10"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"e8dbbfc1ecfe1aa711e785199bf8b3d082572a10e662eb752148b224278b0f58\"" -> "W/\"ee9880bf403b99bac40807d06a4e138e44c6f976e0a4c039af2cb3d882439add\""
        id                          = "MS-Test10"
        name                        = "MS-Test10"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test12"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"4f988dead95ceeb6e114bc088e65290c103241a3e55f32585d69a4337c24f826\"" -> "W/\"2b4c4641bb0be8c1ed56d3510592525087ea678eebffd54dddea3116bbddeb6c\""
        id                          = "MS-Test12"
        name                        = "MS-Test12"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repos.github_repository.repository_configuration_compose["vioc-compose"] will be created
  + resource "github_repository" "repository_configuration_compose" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "vioc-compose"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "internal"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository_file.ci_file["Pipelines"] will be updated in-place
  ~ resource "github_repository_file" "ci_file" {
      ~ content             = <<-EOT
            name: CI
            
            on:
              pull_request:
                branches: [ master ]
            
            jobs:
              build:
            
                runs-on: self-hosted
            
                steps:
                  - uses: actions/checkout@v3
            
                  - name: Set up JDK 11
                    uses: actions/setup-java@v3
                    with:
                      java-version: '11'
                      distribution: 'zulu'
                      server-password: MAVEN_PASSWORD
            
                  - name: Cache local Maven repository
                    uses: actions/cache@v3
                    with:
                      path: ~/.m2/repository
                      key: ${{ runner.os }}-maven-${{ hashFiles('**/pom.xml') }}
                      restore-keys: |
                        ${{ runner.os }}-maven-
            
                  - name: Build with Maven
                    run: mvn -B package -Djacoco.execFile='${coverage.reports.dir}/actions-jacoco.exec'
                    env:
                      MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
            
                  - name: Upload Jacoco coverage
                    uses: actions/upload-artifact@v3
                    with:
                      name: actions-jacoco
                      path: "./target/coverage-reports/actions-jacoco.exec"
            
                  - name: Upload artifacts
                    uses: actions/upload-artifact@v3
                    with:
                      name: ${{ github.event.repository.name }}.jar
                      path: target/${{ github.event.repository.name }}.jar
            
              sonar:
                runs-on: self-hosted
            
                needs: [ build ]
            
                steps:
                  - uses: actions/checkout@v3
                    with:
                      fetch-depth: 0
            
          -       - name: Set up JDK 11
          -         uses: actions/setup-java@v3
          -         with:
          -           java-version: '11'
          -           distribution: 'zulu'
          -           server-password: MAVEN_PASSWORD
          - 
          -       - name: Cache local Maven repository
          -         uses: actions/cache@v3
          -         with:
          -           path: ~/.m2/repository
          -           key: self-hosted-${{ runner.os }}-maven-${{ hashFiles('**/pom.xml') }}
          -           restore-keys: |
          -             self-hosted-${{ runner.os }}-maven-
          - 
          -       - name: Cache SonarQube packages
          -         uses: actions/cache@v3
          -         with:
          -           path: ~/.sonar/cache
          -           key: ${{ runner.os }}-sonarqube
          -           restore-keys: |
          -             ${{ runner.os }}-sonarqube
          - 
          -       - name: Download actions Jacoco coverage
          -         uses: actions/download-artifact@v3
          -         with:
          -           name: actions-jacoco
          - 
          -       - name: Run Jacoco report
          -         run: |
          -           mvn -B compile
          -           mvn jacoco:report@coverage-report -P jacoco-ci
          -         env:
          -           MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
          - 
          -       - name: Scan with SonarQube
          -         run: mvn -B sonar:sonar -Dsonar.pullrequest.key=${{ github.event.number }} -Dsonar.pullrequest.branch=${GITHUB_HEAD_REF} -Dsonar.pullrequest.base=${GITHUB_BASE_REF} -Dsonar.scm.revision=${{ github.event.pull_request.head.sha }}
          -         env:
          -           GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
          -           SONAR_TOKEN: ${{ secrets.SONAR_TOKEN }}
          -           SONAR_HOST_URL: ${{ secrets.SONAR_HOST_URL }}
          -           MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
          +       - name: Print hello
          +         run: hello world!
        EOT
        id                  = "Pipelines/.github/workflows/ci.yml"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>


*Pusher: @josue-r, Action: `pull_request`, Working Directory: `/home/josue/actions-runner/_work/terraform-jrs-local/terraform-jrs-local`, Workflow: `Create terraform plan`*